/*
 * 题目即求m个球最多能把n维空间分成几部分
 * 设f[n,m]表示上述的答案，考虑第m个球与其他球均相交
 * 相交时球是n维的，球面是n-1维的，球面与球面的交集是n - 2维的
 * 其它球面来划分这个球面，相当于把n - 1维区域用m - 1个n - 2维的平面来划分
 * 而n - 2维的这种平面必然是n - 2维的球，因为是球面与球面相交
 * 每个区域都对应着一个n维区域，最多可以把球面划分成f(n - 1, m - 1)个区域
 * 那么这个球内就有f(n - 1, m - 1)个空间，还要加剩下的球，就是f(n, m - 1)
 * f(n, m) = f(n - 1, m - 1) + f(n, m - 1)
 */
#include <cstdio>
int n, m;
long long f[16][101];
int main()
{
	scanf("%d%d", &m, &n);
	for(int i = 1; i <= m; ++i)
		f[1][i] = i << 1;
	for(int i = 1; i <= n; ++i)
		f[i][1] = 2;
	for(int i = 2; i <= n; ++i)
		for(int j = 2; j <= m; ++j)
			f[i][j] = f[i][j - 1] + f[i - 1][j - 1];
	printf("%lld\n", f[n][m]);
	return 0;
}
